public class Main {
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//    lab_6
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

    /*
    Создать приложение, удовлетворяющее требованиям, приведенным в задании. Аргументировать
    принадлежность классу каждого создаваемого метода и корректно переопределить для каждого
    класса методы equals(), hashCode(), toString().
    Создать объект класса Дом, используя классы Окно, Дверь. Методы: закрыть на ключ,
    вывести на консоль количество окон, дверей.
     */
    public static void lab_6() {
        HouseT house = new HouseT(
                new DoorT[]{
                        new DoorT(70, 200, "Wood"),
                        new DoorT(70, 200, "Wood"),
                        new DoorT(100, 210, "Metal")
                },
                new WindowT[]{
                        new WindowT(80, 150),
                        new WindowT(80, 150),
                        new WindowT(160, 150),
                        new WindowT(160, 150)
                }
        );

        System.out.println(house);
    }

}